In [3]:
 # Dependencies
import numpy as np
import requests
import tabula #read tables in PDFs
import pandas as pd
from sqlalchemy import create_engine

## Ohio income tax by county

In [4]:
# Read remote PDF into list of DataFrames
# Individual Income Tax: Taxable Year 2018 IT-1040 Returns, by County
tax_ohio_url="https://tax.ohio.gov/static/communications/publications/annual_reports/2020annualreport.pdf"
income_tax_page_num=165
income_tax_table= tabula.read_pdf(tax_ohio_url,pages=income_tax_page_num)

AttributeError: module 'tabula' has no attribute 'read_pdf'

In [3]:
# choose the first dataframe in the table list
income_pdf_df=income_tax_table[0]

#change display option on column width and display the dataframe
pd.set_option('display.max_colwidth', None)
income_pdf_df

NameError: name 'income_tax_table' is not defined

In [4]:
#change column names
income_pdf_df.columns = income_pdf_df.iloc[2]+" "+income_pdf_df.iloc[3]

# remove unncessary headings  
income_pdf_df=income_pdf_df.drop([0,1,2,3])

# fill the nan column name with "Dollar"
income_pdf_df.columns = income_pdf_df.columns.fillna('Dollar')

#remove the dollar sign with in the content
income_pdf_df=income_pdf_df.replace('\$','',regex=True)
income_pdf_df=income_pdf_df.replace('\,','',regex=True)

# the dataframe after the above process
income_pdf_df.head()

,Number of Federal Adjusted Ohio Income Tax County Returns Gross Income Liability County,Number of Returns,Dollar,Federal Adjusted Gross Income,Ohio Income Tax Liability
4,Adams 10801 510636078 9137991 Lucas,192188,,11495307630,253783325
5,Allen 47553 2652560940 53819629 Madison,19265,,1239937113,26196454
6,Ashland 24343 1283000065 24930240 Mahoning,105957,,5954785375,121834737
7,Ashtabula 42985 2059532429 38304615 Marion,26974,,1322750746,24802115
8,Athens 22539 1167323875 23709431 Medina,91606,,6924402532,163550630

In [5]:
# prepare a data frame to split column values
income_pdf_split=income_pdf_df.rename(columns={'Number of  Federal Adjusted  Ohio Income Tax County Returns Gross Income Liability County':'County'}).copy()

# split the first column content with "space" 
income_left_df = income_pdf_split['County'].str.split(" ", expand=True)
income_left_df.head()

           0      1 2           3 4         5         6     7
4      Adams  10801     510636078     9137991     Lucas  None
5      Allen  47553    2652560940    53819629   Madison  None
6    Ashland  24343    1283000065    24930240  Mahoning  None
7  Ashtabula  42985    2059532429    38304615    Marion  None
8     Athens  22539    1167323875    23709431    Medina  None

In [6]:
# drop columns that have no values
income_left_df=income_left_df.drop([2,4], axis=1)

# replace nan values with "space"
income_left_df=income_left_df.replace(np.nan, ' ', regex=True)

# rename the columns
income_left_df.rename(columns={0:"county_name",
                              1:"num_of_returns",
                               3:"fed_agi",
                              5:"oh_income_tax_liability"},inplace=True)
# the first half of the dataframe is cleaned as shown below
income_left_df.head()

  county_name num_of_returns     fed_agi oh_income_tax_liability         6  7
4       Adams          10801   510636078                 9137991     Lucas
5       Allen          47553  2652560940                53819629   Madison
6     Ashland          24343  1283000065                24930240  Mahoning
7   Ashtabula          42985  2059532429                38304615    Marion
8      Athens          22539  1167323875                23709431    Medina

In [7]:
# drop the first column to get the second half of the dataframe
income_right_df=income_pdf_split.drop(["County"], axis=1)

# add the county_name column from the values from income_left_df
income_right_df["county_name"]=income_left_df[6]+income_left_df[7]

# join "Dollar" and "Federal Adjusted Gross Income" and rename it to "fed_agi"
income_right_df["fed_agi"]=income_right_df["Dollar"]+income_right_df["Federal Adjusted Gross Income"]

# rename the columns
income_right_df.rename(columns={"Number of Returns":"num_of_returns",
                               "Ohio Income Tax Liability":"oh_income_tax_liability"},inplace=True)

# remove the rows which have no value from the second dataframe
income_right_df.dropna(thresh=3,inplace=True)
# the second half of the dataframe is cleaned as shown below
income_right_df.head()

,num_of_returns,Dollar,Federal Adjusted Gross Income,oh_income_tax_liability,county_name,fed_agi
4,192188,,11495307630,253783325,Lucas,11495307630
5,19265,,1239937113,26196454,Madison,1239937113
6,105957,,5954785375,121834737,Mahoning,5954785375
7,26974,,1322750746,24802115,Marion,1322750746
8,91606,,6924402532,163550630,Medina,6924402532

In [8]:
# choose the desired columns from the first and second half dataframes
income_top_df=income_left_df[["county_name","num_of_returns","fed_agi","oh_income_tax_liability"]].copy()
income_bottom_df=income_right_df[["county_name","num_of_returns","fed_agi","oh_income_tax_liability"]].copy()

# concat the two halves into one dataframe based on column names and reset the index
income_tax_df=pd.concat([income_top_df,income_bottom_df]).reset_index(drop=True)

# change datatype to numeric
income_tax_df [["num_of_returns","fed_agi","oh_income_tax_liability"]] =income_tax_df[["num_of_returns","fed_agi","oh_income_tax_liability"]].apply(pd.to_numeric)

# the income_tax_df is read to be loaded into a database
income_tax_df

    county_name  num_of_returns       fed_agi  oh_income_tax_liability
0         Adams           10801  5.106361e+08                  9137991
1         Allen           47553  2.652561e+09                 53819629
2       Ashland           24343  1.283000e+09                 24930240
3     Ashtabula           42985  2.059532e+09                 38304615
4        Athens           22539  1.167324e+09                 23709431
..          ...             ...           ...                      ...
86        Wood            61628  4.210164e+09                 95595090
87     Wyandot            10894  5.862600e+08                 11114002
88  CountyTotal         5431908           NaN               8120878171
89       Other1          230530  1.387316e+11                282944915
90   StateTotal         5662438           NaN               8403823086

[91 rows x 4 columns]

In [ ]:
# Create database connection
# change the owner name, password and port number based on your local situation
# engine = create_engine(f'postgresql://{*database_owner}:{*password}@localhost:{*port}/housing_db')
rds_connection_string = "postgres:postgres@localhost:5433/housing_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [10]:
# Confirm tables
engine.table_names()

<ipython-input-10-df1946b2803a>:5: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['census', 'schools', 'income_tax']

In [12]:
# Load dataframes into databases
income_tax_df.to_sql(name = 'income_tax', con = engine, if_exists = 'append', index = False)

In [13]:
# Confirm data has been added by querying the income_tax table
pd.read_sql_query('select * from income_tax', con=engine).head()

  county_name  num_of_returns       fed_agi  oh_income_tax_liability
0       Adams         10801.0  5.106361e+08                9137991.0
1       Allen         47553.0  2.652561e+09               53819629.0
2     Ashland         24343.0  1.283000e+09               24930240.0
3   Ashtabula         42985.0  2.059532e+09               38304615.0
4      Athens         22539.0  1.167324e+09               23709431.0